
import sys
sys.stdin = open("input.txt", "r")

T = int(input())
# 여러개의 테스트 케이스가 주어지므로, 각각을 처리합니다.
for test_case in range(1, T + 1):
  
    # ///////////////////////////////////////////////////////////////////////////////////
    h1, m1, h2, m2 = map(int, input().split())
    h_r = h1+h2
    m_r = m1+m2
    if m_r >=60:
        m_r = m_r-60
        h_r = h_r+1
        
    print(f'#{test_case} {h_r} {m_r}')  
    # ///////////////////////////////////////////////////////////////////////////////////
